# NetworkErrorExtractCurveData Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..NetworkErrorExtractCurveData Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
The calculation could not be performed. Verify the pump curve data.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NetworkErrorExtractCurveData { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NetworkErrorExtractCurveData As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NetworkErrorExtractCurveData {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace